app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_cart
    session[:counter] = 0
    product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 11)
---
  def decrement_product
    @cart = find_cart
    @cart.delete_product(Product.find(params[:id]))

INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`, `user_id`) VALUES('2009-12-28 16:37:48', 16, 2, 17, 10.0, '2009-12-28 16:37:48', 7)
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('sdfds', 'dsfafdsa', '2009-12-24 15:13:37', '2009-12-24 15:13:37', 'check', 'dsfasf')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart, session[:user_id])
    if @order.save